driver-tests/jmsbc/JMSBCTests/JMSBCJbi/test/JMSBacthTest_Invoke/Output.xml

<?xml version="1.0"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:someNS="http://j2ee.netbeans.org/wsdl/JMSBatchTest/types">
  <SOAP-ENV:Header/>
  <SOAP-ENV:Body>
    <someNS:CountAndMsg xmlns:someNS="http://j2ee.netbeans.org/wsdl/JMSBatchTest/types">
      <MsgCount>20</MsgCount>
      <Msg>A text message paylaod; JMSBatchTest trigger message</Msg>
    </someNS:CountAndMsg>
  </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
